Белгипрозем_2017/src/Documents/М_ВедомостьКомиссии/М_ВедомостьКомиссии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>М_ВедомостьКомиссии</name>
  <registerRecords>AccumulationRegister.НачислениеЗП</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АктыПроверки</name>
    <attributes>
      <name>АктПроверки</name>
      <type>
        <types>CatalogRef.мАктыПроверки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПроверки</name>
      <type>
        <types>EnumRef.М_ВидыПроверкиКачества</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентПроверки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаКомиссии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаНачОтдела</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаГлавСпеца</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаНачОтряда</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачальникОтдела</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ГлавныйСпециалист</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>НачальникОтряда</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроверяющийСТКК</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Корреспондент</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.мВидыРаботПоДоговорам</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаАктирования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаСТКК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаНачОтделаИтоговая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаГлавСпецаИтоговая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаНачОтрядаИтоговая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаИсполнителю</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выставлена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаЗамНачФилиала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаЗамНачФилиалаИтоговая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗамНачФилиала</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/AccumulationRegisters/НачислениеЗП/НачислениеЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НачислениеЗП</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БазовоеНачисление</name>
    <comment>Сумма сделки без учета +/- коэф.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРабот</name>
    <type>
      <types>CatalogRef.мОбъектыРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Белгипрозем_2017/src/Enums/М_СостоянияАктовПроверки/М_СостоянияАктовПроверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>М_СостоянияАктовПроверки</name>
  <enumValues>
    <name>НаПроверке</name>
    <comment>Находится на проверке</comment>
  </enumValues>
  <enumValues>
    <name>НаИсправлении</name>
    <comment>По акту исправляются ошибки и замечания</comment>
  </enumValues>
  <enumValues>
    <name>НаКомиссии</name>
    <comment>Должен рассматриваться (рассматривается) комиссией по проверке качества</comment>
  </enumValues>
  <enumValues>
    <name>Проверен</name>
    <comment>Работа с актом завершена</comment>
  </enumValues>
  <enumValues>
    <name>НеДействителен</name>
    <comment>По каким-то причинам акт не должен использоваться в учете</comment>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Documents/М_ВедомостьКомиссии/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    // Запись итоговой оценки в Акты проверок, в случае, когда они отличаются от 
    //  оценки, выставленной в акте
    
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
    
	Документы.М_ВедомостьКомиссии.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
    
    ЗаписатьИтоговыеОценкиАктовПроверки(ДополнительныеСвойства, Отказ);
    ПересчитатьНачислениеЗП(ДополнительныеСвойства, Отказ);
    
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
КонецПроцедуры

Процедура ПересчитатьНачислениеЗП(ДополнительныеСвойства, Отказ)
    
    Таб = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаИсполнителей;
	
	МассивЭтапов = Таб.ВыгрузитьКолонку("ЭтапДоговора");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеЗПОбороты.Подразделение,
		|	НачислениеЗПОбороты.Исполнитель,
		|	НачислениеЗПОбороты.ЭтапДоговора,
		|	НачислениеЗПОбороты.БазовоеНачислениеОборот КАК БазовоеНачисление,
		|	НачислениеЗПОбороты.Должность,
		|	НачислениеЗПОбороты.Оклад,
		|	НачислениеЗПОбороты.ОбъектРабот
		|ИЗ
		|	РегистрНакопления.НачислениеЗП.Обороты(&ДатаНач, &ДатаКон, Запись, ЭтапДоговора В (&МассивЭтапов)) КАК НачислениеЗПОбороты";
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("МассивЭтапов", МассивЭтапов);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Движения.НачислениеЗП.Записывать = Истина;
	Движения.НачислениеЗП.Очистить();
	
	Для каждого Стр Из Таб Цикл
		//Если Не ЗначениеЗаполнено(Стр.ДатаАктирования) Тогда
		//	Продолжить;
		//КонецЕсли; 
		
		ПараметрыОтбора = Новый Структура("ЭтапДоговора", Стр.ЭтапДоговора); 
		ИскСтроки = Результат.НайтиСтроки(ПараметрыОтбора);
		Если ИскСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Для каждого СтрЭтап Из ИскСтроки Цикл
			
			Если СтрЭтап.Подразделение.Родитель.Наименование = "Отдел геоинформационных систем и технологий" Тогда
				Продолжить;
			КонецЕсли; 
		
			Движение = Движения.НачислениеЗП.Добавить();
			//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ЭтотОбъект.Дата;
			Движение.Подразделение = СтрЭтап.Подразделение;
			Движение.Исполнитель = СтрЭтап.Исполнитель;
			Движение.Должность = СтрЭтап.Должность;
			Движение.Оклад = СтрЭтап.Оклад;
			Движение.ОбъектРабот = СтрЭтап.ОбъектРабот;
			Движение.ЭтапДоговора = СтрЭтап.ЭтапДоговора;
			Движение.Сумма = СтрЭтап.БазовоеНачисление*Стр.Коэффициент;
			Движение.Коэффициент = Стр.Коэффициент;
			
		КонецЦикла; 
		
	КонецЦикла; 

КонецПроцедуры

Процедура ЗаписатьИтоговыеОценкиАктовПроверки(ДополнительныеСвойства, Отказ)
    
    СостояниеПроверен = Перечисления.М_СостоянияАктовПроверки.Проверен;
    
    Таб = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОценок;
    
    Для каждого Стр Из Таб Цикл
        Если Стр.АктПроверки.ОценкаИтоговая = Стр.ОценкаИтоговая Тогда
			Продолжить;
		КонецЕсли; 
		
		АктПроверки = Стр.АктПроверки.ПолучитьОбъект();
        АктПроверки.ОценкаИтоговая = Стр.ОценкаИтоговая;
        АктПроверки.Состояние = СостояниеПроверен;
    
 		Попытка
            АктПроверки.Записать();
		Исключение
			Сообщить("Не удалось записать Акт проверки качества "+АктПроверки.Ссылка);
            Отказ = Истина;
		КонецПопытки;
    КонецЦикла; 

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
    // Отмена Запись итоговой оценки в Акты проверок, в случае, когда они отличаются от 
    //  оценки, выставленной в акте
    
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
    
	Документы.М_ВедомостьКомиссии.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
    
    ОтменитьЗаписатьИтоговыеОценкиАктовПроверки(ДополнительныеСвойства, Отказ);
    
КонецПроцедуры

Процедура ОтменитьЗаписатьИтоговыеОценкиАктовПроверки(ДополнительныеСвойства, Отказ)
    
    СостояниеНаКомиссии = Перечисления.М_СостоянияАктовПроверки.НаКомиссии;
    
    Таб = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОценок;
    
    Для каждого Стр Из Таб Цикл
    
        Если Стр.АктПроверки.ОценкаИтоговая = Стр.Оценка Тогда
			Продолжить;
		КонецЕсли; 
		
		АктПроверки = Стр.АктПроверки.ПолучитьОбъект();
        АктПроверки.ОценкаИтоговая = Стр.Оценка;
        АктПроверки.Состояние = СостояниеНаКомиссии;
    
 		Попытка
            АктПроверки.Записать();
		Исключение
			Сообщить("Не удалось записать Акт проверки качества "+АктПроверки.Ссылка);
            Отказ = Истина;
		КонецПопытки;
    КонецЦикла; 

КонецПроцедуры
